app/controllers/bids_controller.rb

SELECT * FROM "bids" ORDER BY notified, updated_at DESC
---
  def index
    @bids = Bid.all(:order => "notified, updated_at DESC")

SELECT * FROM "bids" WHERE ("bids"."id" = 24)
---
  def edit
    @bid = Bid.find(params[:id])

SELECT * FROM "bids" WHERE ("bids"."id" = 24)
UPDATE "bids" SET "updated_at" = '2010-01-25 17:26:00', "price" = 59000.0, "notified" = 't', "cost" = 3130.0 WHERE "id" = 25
---
  def update
    @bid = Bid.find(params[:id])
    @bid.who_last = current_user.login

    respond_to do |format|
      if @bid.update_attributes(params[:bid])