app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "description") VALUES('Amortiguadores', '2010-01-28 22:20:20', '2010-01-28 22:20:20', '')

  def update
    @category = Category.find(params[:id])

    if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 3)
UPDATE "categories" SET "updated_at" = '2010-01-28 22:30:28', "name" = 'Accesorios', "description" = '' WHERE "id" = 5