app/controllers/customers_controller.rb

SELECT * FROM "customers" ORDER BY created_at DESC
---
  def index
    @customers = Customer.all(:order => 'created_at DESC')

SELECT * FROM "customers" WHERE ("customers"."id" = 39)
---
  def edit
    @customer = Customer.find(params[:id])