app/controllers/expenses_controller.rb

SELECT * FROM "expenses"
---
  def index
    @expenses = Expense.all