app/controllers/inventories_controller.rb

  def new
    @inventory = Inventory.new
    @inventory.product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 100)

  def edit
    @inventory = Inventory.find(params[:id])
---
SELECT * FROM "inventories" WHERE ("inventories"."id" = 213)

  def create
    @inventory = Inventory.new(params[:inventory])
    @inventory.who = current_user.login
    @inventory.who_last = current_user.login

    if @inventory.save
---
INSERT INTO "inventories" ("created_at", "tax_ratio", "product_id", "cost", "updated_at", "top_ratio", "bottom_ratio", "purchase_date", "import_ratio", "who", "currency_ratio") VALUES('2010-01-24 06:48:26', 0.0, 100, 3000.0, '2010-01-24 06:48:26', 0.15, 0.1, '2010-01-24 00:00:00', 0.0, 'benoror', 1.0)

  def update
    @reference = Inventory.find(params[:id])
---
SELECT * FROM "inventories" WHERE ("inventories"."id" = 213)

  def clone
    @inventory = Inventory.find(params[:id]).clone
---
SELECT * FROM "inventories" WHERE ("inventories"."id" = 205)

  def destroy
    @inventory = Inventory.find(params[:id])

    if not @inventory.destroy
---
SELECT * FROM "inventories" WHERE ("inventories"."id" = 217)
DELETE FROM "inventories" WHERE "id" = 217