app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])
    @product.who = current_user.login
    @product.who_last = current_user.login

    if @product.save
---
INSERT INTO "products" ("name", "created_at", "cost", "updated_at", "barcode", "consignment", "category_id", "supplier_id", "description", "who", "image") VALUES('Consigna EJEMPLO', '2010-01-24 06:47:31', 3000.0, '2010-01-24 06:47:31', 'XYZ', 't', 4, 9, '', 'benoror', 'nopic.png')

  def update
    @product = Product.find(params[:id])
    @product.who_last = current_user.login

    if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 74)
UPDATE "products" SET "consignment" = 'f', "updated_at" = '2010-01-28 22:23:11', "description" = 'Suspension Rough Country 4" Jeep Cherokee XJ 1987-2002' WHERE "id" = 35

  def destroy
    @product = Product.find(params[:id])

    if not @product.destroy
---
SELECT * FROM "products" WHERE ("products"."id" = 100)
DELETE FROM "products" WHERE "id" = 100