app/controllers/sales_controller.rb

SELECT * FROM "sales" ORDER BY created_at DESC
---
  def index
    @sales = Sale.all :order => "created_at DESC"

SELECT * FROM "inventories" WHERE (id NOT IN (SELECT inventory_id FROM sales)) AND ("inventories"."product_id" = '61') LIMIT 1
---
  def new
    @sale = Sale.new
    @sale.inventory = Inventory.find_by_product_id(params[:pid], :conditions => "id NOT IN (SELECT inventory_id FROM sales)")

SELECT * FROM "sales" WHERE ("sales"."id" = 1)
---
  def edit
    @sale = Sale.find(params[:id])

SELECT * FROM "inventories" WHERE ("inventories"."id" = 125)
INSERT INTO "sales" ("created_at", "updated_at", "who_last", "invoice_id", "sale_date", "who", "inventory_id", "sale_price") VALUES('2010-02-23 05:54:28', '2010-02-23 05:54:28', 'benoror', NULL, '2010-02-22 00:00:00', 'benoror', 125, 300.0)
---
  def create
    @sale = Sale.new(params[:sale])
    @sale.inventory = Inventory.find(params[:sale][:inventory_id])
    @sale.who = current_user.login
    @sale.who_last = current_user.login

    @inventory = @sale.inventory
    @price = ((@inventory.cost * (1+@inventory.top_ratio) * (1+@inventory.tax_ratio) * (1+@inventory.import_ratio) * @inventory.currency_ratio)/10).ceil*10

    if @sale.save

SELECT * FROM "sales" WHERE ("sales"."id" = 28)
DELETE FROM "sales" WHERE "id" = 28
---
  def destroy
    @sale = Sale.find(params[:id])
    @sale.destroy