app/controllers/suppliers_controller.rb

SELECT * FROM "suppliers"
---
  def index
    @suppliers = Supplier.all

INSERT INTO "suppliers" ("name", "created_at", "updated_at", "description") VALUES('Carlos Martens', '2010-01-24 06:46:57', '2010-01-24 06:46:57', '')
---
  def create
    @supplier = Supplier.new(params[:supplier])

    if @supplier.save