app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.all
---
SELECT * FROM "transactions"

  def create
    @transaction = Transaction.new(params[:transaction])
    @transaction.who = current_user.login

    if @transaction.save
---
INSERT INTO "transactions" ("name", "created_at", "updated_at", "date", "payment", "charge") VALUES('Deposito Ventas', '2010-01-25 17:33:50', '2010-01-25 17:33:50', '2010-01-25 17:32:00', 9390.0, NULL)

  def destroy
    @transaction = Transaction.find(params[:id])
    @transaction.destroy
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 2)
DELETE FROM "transactions" WHERE "id" = 2